app/controllers/signprofs_controller.rb

  def index
    @signprofs = Signprof.all
---
SELECT "signprofs".* FROM "signprofs"

  def create
    @signprof = Signprof.new(signprof_params)

    respond_to do |format|
      if @signprof.save
---
INSERT INTO "signprofs" ("address", "created_at", "email", "name", "phone", "qualification", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["address", ""], ["created_at", "2014-11-20 06:24:52.685005"], ["email", ""], ["name", ""], ["phone", ""], ["qualification", ""], ["updated_at", "2014-11-20 06:24:52.685005"]]

  def update
    respond_to do |format|
      if @signprof.update(signprof_params)
---
UPDATE "signprofs" SET "address" = ?, "email" = ?, "name" = ?, "phone" = ?, "qualification" = ?, "updated_at" = ? WHERE "signprofs"."id" = 1  [["address", "marriamman koil street"], ["email", "devakumar.mj@gmail.com"], ["name", "devakumar"], ["phone", "8754862067"], ["qualification", "B.E"], ["updated_at", "2014-11-20 07:07:21.393611"]]

  def destroy
    @signprof.destroy
---
DELETE FROM "signprofs" WHERE "signprofs"."id" = ?  [["id", 1]]

    def set_signprof
      @signprof = Signprof.find(params[:id])
---
SELECT  "signprofs".* FROM "signprofs"  WHERE "signprofs"."id" = ? LIMIT 1  [["id", 1]]